cf_billing/InformationRegisters/энргНастройкиВыполненияГодовойКорректировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиВыполненияГодовойКорректировки</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиВыполненияГодовойКорректировки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	энргЛокализацияСервер.ПриСозданииНаСервере_энргНастройкиВыполненияГодовойКорректировки(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ.Период) Тогда
		Запись.НачалоПериода 		= НачалоГода(ТекущаяДата());
		Запись.КонецПериода 		= НачалоМесяца(КонецГода(ТекущаяДата()));
	КонецЕсли;
	
	ПредставлениеНачалоПериода 		= Формат(Запись.НачалоПериода,"ДФ=ММММ");
	ПредставлениеОкончаниеПериода 	= Формат(Запись.КонецПериода,"ДФ=ММММ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 		= Ложь;
	Запись.НачалоПериода 			= ДобавитьМесяц(Запись.НачалоПериода, Направление);
	ПредставлениеНачалоПериода 		= Формат(Запись.НачалоПериода,"ДФ=ММММ");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь;
	Запись.КонецПериода 			= ДобавитьМесяц(Запись.КонецПериода, Направление);
	ПредставлениеОкончаниеПериода 	= Формат(Запись.КонецПериода,"ДФ=ММММ");
	
КонецПроцедуры

#КонецОбласти
